app/controllers/content_controller.rb

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = '2') ORDER BY updated_at DESC
SELECT "posts".* FROM "posts" WHERE (position = 'minipost1') ORDER BY updated_at DESC LIMIT 5
---
  def menu2_1
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu2_1")
    @postsMinipost1 = Post.where(["position = ?", "minipost1"]).limit(5).order("updated_at DESC")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = '2') ORDER BY updated_at DESC
SELECT "posts".* FROM "posts" WHERE (position = 'minipost1') ORDER BY updated_at DESC LIMIT 5
---
  def menu2_2
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu2_2")
    @postsMinipost1 = Post.where(["position = ?", "minipost1"]).limit(5).order("updated_at DESC")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = '2') ORDER BY title
---
  def menu2_3
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu2_3")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = '2') ORDER BY title
---
  def menu2_4
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu2_4")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = '2') ORDER BY updated_at DESC
SELECT "posts".* FROM "posts" WHERE (position = 'minipost1') ORDER BY updated_at DESC LIMIT 5
---
  def menu3_1
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu3_1")
    @postsMinipost1 = Post.where(["position = ?", "minipost1"]).limit(5).order("updated_at DESC")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = '2') ORDER BY updated_at DESC
SELECT "posts".* FROM "posts" WHERE (position = 'minipost1') ORDER BY updated_at DESC LIMIT 5
---
  def menu3_2
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu3_2")
    @postsMinipost1 = Post.where(["position = ?", "minipost1"]).limit(5).order("updated_at DESC")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = 'menu4_1') ORDER BY title
---
  def menu4_1
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu4_1")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = '2') ORDER BY updated_at DESC
SELECT "posts".* FROM "posts" WHERE (position = 'minipost1') ORDER BY updated_at DESC LIMIT 5
---
  def menu4_1_1
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu4_1_1")
    @postsMinipost1 = Post.where(["position = ?", "minipost1"]).limit(5).order("updated_at DESC")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost') ORDER BY title
---
  def menu4_1_2
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu4_1_2")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = 'menu4_1_3') ORDER BY title
---
  def menu4_1_3
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu4_1_3")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = 'menu5_1') ORDER BY title
---
  def menu5_1
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu5_1")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = 'menu5_2') ORDER BY title
---
  def menu5_2
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu5_2")

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = 'menu6_1') ORDER BY title
---
  def menu6_1
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "menu6_1")