app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY title

  def show
    @post = Post.find(params[:id])
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "2").order("updated_at DESC")
    @postsMinipost1 = Post.where(["position = ?", "minipost1"]).limit(5).order("updated_at DESC")
---
SELECT "posts".* FROM "posts" WHERE (position = 'minipost1') ORDER BY title, posts.created_at ASC LIMIT 1
SELECT "posts".* FROM "posts" WHERE (position = 'minipost1') ORDER BY updated_at DESC LIMIT 5

  def edit
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 3 ORDER BY title LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ('BIMBINGAN TEKNIS KEMENTERIAN KOMINFO RI DI KOTA MANADO', 'Ditjen Informasi dan Komunikasi Publik Kementerian Kominfo RI mengadakan bimbingan teknis pengelolaan portal info publik bagi petugas pengelola Media Center (Reporter) Wilayah timur, bimbingan teknis dilaksanakan di Kota Manado Provinsi Sulawesi Utara tanggal 17-18 Juni 2011. Bimbingan teknis ini di hadiri para undangan pengelola Media center yang berada di Wilayah Timur Indonesia, tercatat 35 kabupaten / kota dan provinsi yang menghadiri bimbingan teknis ini. Diantaranya Makassar, Gorontalo dan Manokwari termasuk didalamnya.

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 3 ORDER BY title LIMIT 1
UPDATE "posts" SET "content" = '<p>Ditjen Informasi dan Komunikasi Publik Kementerian Kominfo RI mengadakan bimbingan teknis pengelolaan portal info publik bagi petugas pengelola Media Center (Reporter) Wilayah timur, bimbingan teknis dilaksanakan di Kota Manado Provinsi Sulawesi Utara tanggal 17-18 Juni 2011. Bimbingan teknis ini di hadiri para undangan pengelola Media center yang berada di Wilayah Timur Indonesia, tercatat 35 kabupaten / kota dan provinsi yang menghadiri bimbingan teknis ini. Diantaranya Makassar, Gorontalo dan Manokwari termasuk didalamnya.</p>

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 5 ORDER BY title LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = 5