app/controllers/store_controller.rb

SELECT "posts".* FROM "posts" WHERE (position = 'mainpost' AND typepost = '2') ORDER BY title, updated_at ASC
SELECT "posts".* FROM "posts" WHERE (position = 'minipost1') ORDER BY updated_at DESC LIMIT 2
---
  def index
    @postsMainDinamic = Post.where("position = ? AND typepost = ?", "mainpost", "2").order("updated_at DESC")
    @postsMinipost1 = Post.where(["position = ?", "minipost1"]).limit(5).order("updated_at DESC")
    @postsMinipost2 = Post.where(["position = ?", "minipost2"]).limit(5).order("updated_at DESC")
    @postsMinipost3 = Post.where(["position = ?", "minipost3"]).limit(5).order("updated_at DESC")
    @postsListMainDinamic= Post.where("position = ? AND typepost = ?", "mainpost", "2").order("updated_at DESC")
    @postsRightSidebar1 = Post.where("position = ? AND typepost = ?", "mainpost", "2").limit(1)