app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('mamatozay', 'mamatozay.enine@gmail.com', '2011-12-05 12:43:50.485516', '2011-12-05 12:43:50.485516', 'cfe4317ce810b1cc6318c308dcd0f486d4acd5978a17f00776a4be1774368f9e', 'bed58fd6083e8d8f1e2d1e2a18dcbaab4dae4c28caf369641dc8b57d38f60519')